app/controllers/gigs_controller.rb

SELECT  "gigs".* FROM "gigs" WHERE "gigs"."id" = $1 LIMIT $2
SELECT  "proposals".* FROM "proposals" WHERE "proposals"."id" IS NULL ORDER BY "proposals"."id" ASC LIMIT $1
---
  def show
    @gig = Gig.find(params[:id])
    @proposals = @gig.proposals.order("created_at DESC").joins(:user)
    @awarded_proposal = Proposal.where(id: @gig.awarded_proposal).first